GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Core/Inc/stm32f1xx_defines.h
#define IS_TIM_REPETITION_COUNTER_INSTANCE(INSTANCE)\
	((INSTANCE) == TIM1)

#define IS_TIM_CLOCK_DIVISION_INSTANCE(INSTANCE)\
	(((INSTANCE) == TIM1)    || \
	 ((INSTANCE) == TIM2)    || \
	 ((INSTANCE) == TIM3)    || \
	 ((INSTANCE) == TIM4))

#define IS_TIM_DMA_INSTANCE(INSTANCE)\
	(((INSTANCE) == TIM1)    || \
	 ((INSTANCE) == TIM2)    || \
	 ((INSTANCE) == TIM3)    || \
	 ((INSTANCE) == TIM4))
	
#define IS_TIM_DMA_CC_INSTANCE(INSTANCE)\
	(((INSTANCE) == TIM1)    || \
	 ((INSTANCE) == TIM2)    || \
	 ((INSTANCE) == TIM3)    || \
	 ((INSTANCE) == TIM4))
	
#define IS_TIM_COMMUTATION_EVENT_INSTANCE(INSTANCE)\
	((INSTANCE) == TIM1)

#define IS_TIM_ETR_INSTANCE(INSTANCE)  (((INSTANCE) == TIM1)    || \
										((INSTANCE) == TIM2)    || \
										((INSTANCE) == TIM3)    || \
										((INSTANCE) == TIM4))

#define IS_TIM_HALL_SENSOR_INTERFACE_INSTANCE(INSTANCE) (((INSTANCE) == TIM1)    || \
														 ((INSTANCE) == TIM2)    || \
														 ((INSTANCE) == TIM3)    || \
														 ((INSTANCE) == TIM4))

#define IS_TIM_32B_COUNTER_INSTANCE(INSTANCE)           0U

/****************************** END TIM Instances *****************************/


/******************** USART Instances : Synchronous mode **********************/                                           
#define IS_USART_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
									 ((INSTANCE) == USART2) || \
									 ((INSTANCE) == USART3))

/******************** UART Instances : Asynchronous mode **********************/
#define IS_UART_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
									((INSTANCE) == USART2) || \
									((INSTANCE) == USART3))

/******************** UART Instances : Half-Duplex mode **********************/
#define IS_UART_HALFDUPLEX_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
												 ((INSTANCE) == USART2) || \
												 ((INSTANCE) == USART3))

/******************** UART Instances : LIN mode **********************/
#define IS_UART_LIN_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
										((INSTANCE) == USART2) || \
										((INSTANCE) == USART3))

/****************** UART Instances : Hardware Flow control ********************/                                    
#define IS_UART_HWFLOW_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
											 ((INSTANCE) == USART2) || \
											 ((INSTANCE) == USART3))

/********************* UART Instances : Smard card mode ***********************/
#define IS_SMARTCARD_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
										 ((INSTANCE) == USART2) || \
										 ((INSTANCE) == USART3))

/*********************** UART Instances : IRDA mode ***************************/
#define IS_IRDA_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
									((INSTANCE) == USART2) || \
									((INSTANCE) == USART3))

/***************** UART Instances : Multi-Processor mode **********************/
#define IS_UART_MULTIPROCESSOR_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
													 ((INSTANCE) == USART2) || \
													 ((INSTANCE) == USART3))

/***************** UART Instances : DMA mode available **********************/
#define IS_UART_DMA_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
										((INSTANCE) == USART2) || \
										((INSTANCE) == USART3))

/****************************** RTC Instances *********************************/
#define IS_RTC_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == RTC)

/**************************** WWDG Instances *****************************/
#define IS_WWDG_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == WWDG)

/****************************** USB Instances ********************************/
#define IS_PCD_ALL_INSTANCE(INSTANCE)   ((INSTANCE) == USB)

/****************************** Clock ********************************/
#define RCC_HSE_MIN         4000000U
#define RCC_HSE_MAX        16000000U

#define RCC_MAX_FREQUENCY  72000000U

// C++ Safeguards
#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32F1XX_DEFINES_H_ */ 